In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
    {"a" : [4,5,6],
    "b" : [7,8,9],
    "c" : [10,11,12]},
    index = [1,2,3])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [3]:
df["a"]

1    4
2    5
3    6
Name: a, dtype: int64

In [4]:
df[["a","b"]]

   a  b
1  4  7
2  5  8
3  6  9

In [5]:
df.loc[[1,2],["a","b"]]

   a  b
1  4  7
2  5  8

In [6]:
df[["a"]]

   a
1  4
2  5
3  6

In [37]:
df = pd.DataFrame(
    {"a" : [4,5,6,6],
     "b" : [7,8,9,9],
     "c" : [10,11,12,12]},
     index = pd.MultiIndex.from_tuples(
     [("d",1),("d",2),("e",2),('e',3)],
     names = ["n","v"]))
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [38]:
df.index

MultiIndex([('d', 1),
            ('d', 2),
            ('e', 2),
            ('e', 3)],
           names=['n', 'v'])

In [39]:
df[df.b > 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12
  3  6  9  12

In [40]:
df[df['b'] > 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12
  3  6  9  12

In [41]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [43]:
#중복값 제거
df.drop_duplicates()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [45]:
df = df.drop_duplicates()
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [48]:
df[df['b'] != 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [56]:
df.a.isin([5])

n  v
d  1    False
   2     True
e  2    False
Name: a, dtype: bool

In [57]:
df['a'].isin([5])

n  v
d  1    False
   2     True
e  2    False
Name: a, dtype: bool

In [58]:
df = pd.DataFrame(
    {"a" : [4,5,6,6,np.nan],
     "b" : [7,8,np.nan,9,9],
     "c" : [10,11,12,np.nan,12]},
     index = pd.MultiIndex.from_tuples(
     [("d",1),("d",2),("e",2),('e',3),('e',4)],
     names = ["n","v"]))
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [59]:
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True  False
  3  False  False   True
  4   True  False  False

In [60]:
df['a'].isnull().sum()

1

In [62]:
pd.notnull(df)

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 2   True  False   True
  3   True   True  False
  4  False   True   True

In [63]:
df.notnull().sum()

a    4
b    4
c    4
dtype: int64

In [64]:
df.a.notnull()

n  v
d  1     True
   2     True
e  2     True
   3     True
   4    False
Name: a, dtype: bool

In [65]:
df.any()

a    True
b    True
c    True
dtype: bool

In [66]:
df.all()

a    True
b    True
c    True
dtype: bool

In [92]:
# ~ 반대값 표시(not의미)
df.a.notnull()

n  v
d  1     True
   2     True
e  2     True
   3     True
   4    False
Name: a, dtype: bool

In [93]:
df.b

n  v
d  1    7.0
   2    8.0
e  2    NaN
   3    9.0
   4    9.0
Name: b, dtype: float64

In [94]:
True and False

False

In [98]:
df[(df.b == 7) | (df.a == 5)]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [90]:
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [99]:
df.head()

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [100]:
df.tail()

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [102]:
df.nlargest(2,'c')

       a    b     c
n v
e 2  6.0  NaN  12.0
  4  NaN  9.0  12.0

In [107]:
df.sample(frac=1)

       a    b     c
n v
e 3  6.0  9.0   NaN
  2  6.0  NaN  12.0
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 4  NaN  9.0  12.0

In [112]:
df.sample(n=3)

       a    b     c
n v
d 2  5.0  8.0  11.0
  1  4.0  7.0  10.0
e 4  NaN  9.0  12.0

In [114]:
# iloc : 인덱스로 데이터 불러오기
df.iloc[1:3]

       a    b     c
n v
d 2  5.0  8.0  11.0
e 2  6.0  NaN  12.0

In [115]:
df.iloc[-2:]

       a    b     c
n v
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0